#+TITLE: Chib's estimation of the marginal density for a hierarchical finite normal mixture
#+DATE:  2015-07-17 Fri
#+email: rscharpf@jhu.edu
#+author:  Rob Scharpf

** Simple usage

The following function computes the marginal likelihood using Chib's
method with bias correction.  The second argument to
~marginalLikelihood~ is the number of iterations used in the reduced
Gibb's samplers.

#+BEGIN_SRC R :tangle scripts/batch_lik.R :session *R* :exports both
  (m.y <- marginalLikelihood(fit, 1000))
  published.mlik <- -226.791  
  round(abs(m.y - published.mlik), 2)
#+END_SRC

#+RESULTS:
: 1.49

